name: "CaffeNet"
input: "data"
input_shape {
  dim: 1 # batchsize
  dim: 1 # number of colour channels - rgb
  dim: 28 # width
  dim: 28 # height
}

layer {
  name: "myneuron2"
  type: "MyNeuron2"
  bottom: "data"
  top: "data_out"
  my_neuron2_param {
    power : 1
    append : 3
  }
}

